math/writing.org
#+TITLE: Writing Mathematics
#+AUTHOR: Alex Nelson
#+EMAIL: pqnelson@gmail.com
#+DATE: <2024-06-04T09:19:05-07:00>
#+LANGUAGE: en
#+OPTIONS: H:5
#+HTML_DOCTYPE: html5
#+INCLUDE: ../org-macros.org
#+HTML_LINK_UP: ./index.html
#+HTML_LINK_HOME: ../index.html
#+HTML_HEAD_EXTRA: <link rel="stylesheet" type="text/css" href="../css/stylesheet.css" />
# Created Tuesday June  4, 2024 at  9:19AM

These are random notes from various places, and my experiences at
writing mathematics.

* Steenrod, Halmos, Schiffer, Dieudonne, "How to write mathematics"
:PROPERTIES:
:CUSTOM_ID: h-6a990418-85d7-4714-b7ee-20043a38da59
:END:

** Steenrod's essay
:PROPERTIES:
:CUSTOM_ID: h-9ec74949-7351-48f9-a21f-d280d8f656aa
:END:

- Steenrod distinguishes {{{dfn(formal structure)}}} in mathematical
  writing from {{{dfn(informal structure)}}} and asserts "This division
  of the material should be conspicuously maintained in any mathematical
  presentation" because it makes the logical structure clear.
  - Formal structure: definitions, theorems, proofs
  - Informal structure: motivations, analogies, examples,
    "metamathematical explanations"
- The primary purpose of a book is to present the formal structure.
- A secondary purpose (almost as important) is to offer the reader a
  method whereby they can fit the new structure into what they already
  know. It is here, in this secondary purpose, that authors exhibit
  greatest variations in skill and art.
  - What are the basic questions that will be answered?
  - What are the crucial examples that motivate development?
  - What are vaguely formulated principles from which the entire theory
    seems to unroll effortlessly?
- Huge danger in writing /about/ mathematics instead of /doing it/

*** Expository problems of formal structure
:PROPERTIES:
:CUSTOM_ID: h-348f482d-88c6-4725-80fb-0552de84f428
:END:

- "Normal readers" start at the beginning, read every page, all the way
  until the end.
- "Grasshopper readers" read a book to fill gaps in knowledge

#+begin_quote
The needs of the grasshoppers are served by a good map of the
territory, an adequate directory, numerous sign posts, and an index
of locations. By a /map/ I mean an outline of the results of the book,
such as can be given in an introductory chapter (see the next section
where this is discussed). By a /directory/ I mean the table of contents;
to be adequate, it should contain section headings as well as chapter
titles. (By a /section/ I mean a unit whose average length is three to
five pages.) The /sign posts/ are the chapter titles, section headings,
the paragraph headings such as Definition, Theorem, etc., and the
numbers of these and other important statements.
#+end_quote

- Steenrod vociferously advocates paragraph numbering, with the numbers
  living in the left margin (apparently he believes this makes it easier
  to locate the paragraph): "Actually it would be most convenient to
  have the numbers appear in the left margins, but this requires
  exceptionally expensive setting of type. The next best procedure is to
  use boldface numbers close to the left margin. Authors must deal
  firmly with editors who complain of the ugliness of the boldface
  splotches running down the page."
  - Actually, thinking about this some more, I would argue that the
    number should be in the "outer margin" for books (and in footnote
    size), and/or following the dictionary with the "start section" and
    "final section" [if different] in the header of the page. This would
    satisfy the desire for "quickly being able to locate a paragraph by
    number".  
- If we recall our reading habits, most mathematicians are grasshoppers
  (or so Steenrod asserts). So we should write for grasshoppers.

*** The informal structure
:PROPERTIES:
:CUSTOM_ID: h-2eb40d30-9038-4870-b479-b2f1fd0043a5
:END:

- With informal structure, the restrictions are minimal and guidelines
  are difficult to discern.
- The introductory parts discuss the following kinds of informal
  material:
  1. brief reviews of background material to set the stage,
  2. presentation of motivations or leading questions,
  3. considerations of examples to derive conjectures,
  4. rough descriptions of examples to be obtained and methods to be used,
  5. an outline of the book by chapters.
- Informal items which follow related formal material:
  1. connections with other subjects,
  2. discussions of alternative treatments, and
  3. historical comments.
- Weyl's /The Classical Groups/ is cited as exemplary in providing
  historical notes and bibliographical references.
- Do we really need an introductory chapter?
- There are two ways a student learns material, which anachronistically
  seem to correspond to bottom-up programmind and top-down programming:
  1. (Bottom-up) Ask the reader to examine hte lumber, bricks, and small structural
     members out of which the building is to be made, then to make
     subassemblies, and finally erect the building from these.
  2. (Top-down) Describe the building roughly but globally and provide a
     framework for viewing it, then examine the construction of the
     building in detail.
- Steenrod advocates the "top-down" approach to exposition which he
  calls "successive refinement".
     
*** Successive Refinements
:PROPERTIES:
:CUSTOM_ID: h-9da8c34a-1936-4d01-9485-75e08b860ea0
:END:

- This is an incomplete section, and it's unclear what Steenrod is
  really advocating here.

