docs/math/writing.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Writing Mathematics</title>
<meta name="author" content="Alex Nelson" />
<meta name="generator" content="Org Mode" />
<link rel="preconnect" href="https://fonts.gstatic.com"><link href="https://fonts.googleapis.com/css2?family=Spectral&display=swap" rel="stylesheet">
<link href="https://fonts.googleapis.com/css2?family=Merriweather" rel="stylesheet">
<div style="display: none"> \(
\newcommand\D{\mathrm{d}}
\newcommand\E{\mathrm{e}}
\newcommand\I{\mathrm{i}}
\newcommand\bigOh{\mathcal{O}}
\newcommand{\cat}[1]{\mathbf{#1}}
\newcommand\curl{\vec{\nabla}\times}
\newcommand{\CC}{\mathbb{C}}
\newcommand{\NN}{\mathbb{N}}
\newcommand{\QQ}{\mathbb{Q}}
\newcommand{\RR}{\mathbb{R}}
\newcommand{\ZZ}{\mathbb{Z}}
\)</div>
<link rel="stylesheet" type="text/css" href="../css/stylesheet.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Writing Mathematics</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#h-6a990418-85d7-4714-b7ee-20043a38da59">1. Steenrod, Halmos, Schiffer, Dieudonne, "How to write mathematics"</a>
<ul>
<li><a href="#h-9ec74949-7351-48f9-a21f-d280d8f656aa">1.1. Steenrod's essay</a>
<ul>
<li><a href="#h-348f482d-88c6-4725-80fb-0552de84f428">1.1.1. Expository problems of formal structure</a></li>
<li><a href="#h-2eb40d30-9038-4870-b479-b2f1fd0043a5">1.1.2. The informal structure</a></li>
<li><a href="#h-9da8c34a-1936-4d01-9485-75e08b860ea0">1.1.3. Successive Refinements</a></li>
</ul>
</li>
<li><a href="#h-d767e507-f335-4eac-b937-89968dff4e2a">1.2. Halmos's Essay</a></li>
<li><a href="#h-80a67b77-d30c-4544-a2db-ce2d3d4c5692">1.3. Menahem M Schiffer's Essay</a></li>
<li><a href="#h-c2d89fe2-64b5-4ac8-a048-fecb8a294a8c">1.4. Dieudonne's Essay</a></li>
</ul>
</li>
<li><a href="#h-3b77b4ed-12c1-4e96-b7dc-f4c6f448fc1b">2. Knuth, Larrabee, Roberts, "Mathematical Writing"</a>
<ul>
<li><a href="#h-6a57ac3a-c0d6-4d90-be37-3c4961d24ccd">2.1. Lecture 10: Presenting Algorithms</a>
<ul>
<li><a href="#h-0289f012-bf77-4cfa-8dea-76e6f2ccbaf4">2.1.1. About Algorithms</a></li>
<li><a href="#h-cc41d351-971a-4d9b-82f6-69e4cb294a2f">2.1.2. About <code>WEB</code></a></li>
</ul>
</li>
<li><a href="#h-cb32061d-d5c9-49fd-911f-43369b0d4638">2.2. Lecture 11: Literate Programming</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
These are random notes from various places, and my experiences at
writing mathematics.
</p>

<div id="outline-container-h-6a990418-85d7-4714-b7ee-20043a38da59" class="outline-2">
<h2 id="h-6a990418-85d7-4714-b7ee-20043a38da59"><span class="section-number-2">1.</span> Steenrod, Halmos, Schiffer, Dieudonne, "How to write mathematics"</h2>
<div class="outline-text-2" id="text-h-6a990418-85d7-4714-b7ee-20043a38da59">
</div>

<div id="outline-container-h-9ec74949-7351-48f9-a21f-d280d8f656aa" class="outline-3">
<h3 id="h-9ec74949-7351-48f9-a21f-d280d8f656aa"><span class="section-number-3">1.1.</span> Steenrod's essay</h3>
<div class="outline-text-3" id="text-h-9ec74949-7351-48f9-a21f-d280d8f656aa">
<ul class="org-ul">
<li>Steenrod distinguishes <dfn>formal structure</dfn> in mathematical
writing from <dfn>informal structure</dfn> and asserts "This division
of the material should be conspicuously maintained in any mathematical
presentation" because it makes the logical structure clear.
<ul class="org-ul">
<li>Formal structure: definitions, theorems, proofs</li>
<li>Informal structure: motivations, analogies, examples,
"metamathematical explanations"</li>
</ul></li>
<li>The primary purpose of a book is to present the formal structure.</li>
<li>A secondary purpose (almost as important) is to offer the reader a
method whereby they can fit the new structure into what they already
know. It is here, in this secondary purpose, that authors exhibit
greatest variations in skill and art.
<ul class="org-ul">
<li>What are the basic questions that will be answered?</li>
<li>What are the crucial examples that motivate development?</li>
<li>What are vaguely formulated principles from which the entire theory
seems to unroll effortlessly?</li>
</ul></li>
<li>Huge danger in writing <i>about</i> mathematics instead of <i>doing it</i></li>
</ul>
</div>

<div id="outline-container-h-348f482d-88c6-4725-80fb-0552de84f428" class="outline-4">
<h4 id="h-348f482d-88c6-4725-80fb-0552de84f428"><span class="section-number-4">1.1.1.</span> Expository problems of formal structure</h4>
<div class="outline-text-4" id="text-h-348f482d-88c6-4725-80fb-0552de84f428">
<ul class="org-ul">
<li>"Normal readers" start at the beginning, read every page, all the way
until the end.</li>
<li>"Grasshopper readers" read a book to fill gaps in knowledge</li>
</ul>

<blockquote>
<p>
The needs of the grasshoppers are served by a good map of the
territory, an adequate directory, numerous sign posts, and an index
of locations. By a <i>map</i> I mean an outline of the results of the book,
such as can be given in an introductory chapter (see the next section
where this is discussed). By a <i>directory</i> I mean the table of contents;
to be adequate, it should contain section headings as well as chapter
titles. (By a <i>section</i> I mean a unit whose average length is three to
five pages.) The <i>sign posts</i> are the chapter titles, section headings,
the paragraph headings such as Definition, Theorem, etc., and the
numbers of these and other important statements.
</p>
</blockquote>

<ul class="org-ul">
<li>Steenrod vociferously advocates paragraph numbering, with the numbers
living in the left margin (apparently he believes this makes it easier
to locate the paragraph): "Actually it would be most convenient to
have the numbers appear in the left margins, but this requires
exceptionally expensive setting of type. The next best procedure is to
use boldface numbers close to the left margin. Authors must deal
firmly with editors who complain of the ugliness of the boldface
splotches running down the page."
<ul class="org-ul">
<li>Actually, thinking about this some more, I would argue that the
number should be in the "outer margin" for books (and in footnote
size), and/or following the dictionary with the "start section" and
"final section" [if different] in the header of the page. This would
satisfy the desire for "quickly being able to locate a paragraph by
number".</li>
</ul></li>
<li>If we recall our reading habits, most mathematicians are grasshoppers
(or so Steenrod asserts). So we should write for grasshoppers.</li>
</ul>
</div>
</div>

<div id="outline-container-h-2eb40d30-9038-4870-b479-b2f1fd0043a5" class="outline-4">
<h4 id="h-2eb40d30-9038-4870-b479-b2f1fd0043a5"><span class="section-number-4">1.1.2.</span> The informal structure</h4>
<div class="outline-text-4" id="text-h-2eb40d30-9038-4870-b479-b2f1fd0043a5">
<ul class="org-ul">
<li>With informal structure, the restrictions are minimal and guidelines
are difficult to discern.</li>
<li>The introductory parts discuss the following kinds of informal
material:
<ol class="org-ol">
<li>brief reviews of background material to set the stage,</li>
<li>presentation of motivations or leading questions,</li>
<li>considerations of examples to derive conjectures,</li>
<li>rough descriptions of examples to be obtained and methods to be used,</li>
<li>an outline of the book by chapters.</li>
</ol></li>
<li>Informal items which follow related formal material:
<ol class="org-ol">
<li>connections with other subjects,</li>
<li>discussions of alternative treatments, and</li>
<li>historical comments.</li>
</ol></li>
<li>Weyl's <i>The Classical Groups</i> is cited as exemplary in providing
historical notes and bibliographical references.</li>
<li>Do we really need an introductory chapter?</li>
<li>There are two ways a student learns material, which anachronistically
seem to correspond to bottom-up programmind and top-down programming:
<ol class="org-ol">
<li>(Bottom-up) Ask the reader to examine hte lumber, bricks, and small structural
members out of which the building is to be made, then to make
subassemblies, and finally erect the building from these.</li>
<li>(Top-down) Describe the building roughly but globally and provide a
framework for viewing it, then examine the construction of the
building in detail.</li>
</ol></li>
<li>Steenrod advocates the "top-down" approach to exposition which he
calls "successive refinement".</li>
</ul>
</div>
</div>

<div id="outline-container-h-9da8c34a-1936-4d01-9485-75e08b860ea0" class="outline-4">
<h4 id="h-9da8c34a-1936-4d01-9485-75e08b860ea0"><span class="section-number-4">1.1.3.</span> Successive Refinements</h4>
<div class="outline-text-4" id="text-h-9da8c34a-1936-4d01-9485-75e08b860ea0">
<ul class="org-ul">
<li>This is an incomplete section, and it's unclear what Steenrod is
really advocating here.</li>
</ul>
</div>
</div>
</div>
