math/writing.org
** Halmos's Essay
:PROPERTIES:
:CUSTOM_ID: h-d767e507-f335-4eac-b937-89968dff4e2a
:END:

This is probably the most famous entry in the book, and can be found if
you google for it. The essay spans pages 19--48 (so, roughly 29 of the
64 pages of the book, nearly half the book is Halmos's essay!). The
essay consists of 21 sections, beginning with section 0 "Preface".

1. Have something to say
   - The problem is to communicate an idea. To do so, and to do it
     clearly, you must:
     - have something to say,
     - have someone to say it to,
     - organize what you want to say,
     - arrange it in the order you want it said in,
     - write it, rewrite it, re-rewrite it several times,
     - be willing to think hard about it and work hard on the mechanical
       details (e.g., diction, notation, punctuation, etc.).
   - That's basically it.
2. Say something
   - Problem 1: you have nothing to say.
   - Problem 2: you have too much to say.
     - Calculus textbooks have this problem because "calculus" isn't a
       single subject, it's an alloy: a mixture of
       many interesting subjects.
   - "To have something to say is by far the most important ingredient
     of good exposition".
3. Speak to someone
   - This determines:
     - the amount of motivation you need to put in,
     - the extent of informality you may allow yourself,
     - the fussiness of the detail that is necessary,
     - the number of times things have to be repeated.
   - All writing is influenced by the audience. But given the audience,
     an author's problem is then to communicate with it as best they can.
   - Anticipate and avoid the reader's difficulties.
4. Organize first
   - Organize and arrange the material so as to (a) minimize the resistance
     and maximize the insight of the reader, (b) keep the reader on
     track with no unintended distractions.
   - Why prefer a book over a stack of papers?
     - Efficient and pleasant arrangement
     - Emphasis where emphasis is needed
     - Indication of interconnections
     - Description of examples and counter-examples on which the theory
       is based.
   - These are precisely "organization".
   - Once you know what you want to say (and to whom you want to say
     it), the next step is to make an outline.
   - To organize a subject means: to decide what the main headings and
     subheadings are, what goes under each, and what are the connections
     among them. (A diagram of the organization is a graph, probably a
     tree, but not a linear chain.) There are many ways to organize a
     subject.
     - We then arrange the results of the method of organization in a
       linear fashion.
     - Organization > Arrangement.
   - The preparation of an outline can take years (or, at the very
     least, many weeks).
   - Halmos remarks that when he does his daily work, he daydreams about
     the project, and as ideas occur he jots them down on loose slips of
     paper then places them "helter-skelter" in a folder. Ideas could be
     what fields of math to include, it could be a proof, it may be a
     witticism. Then when Halmos writes, he "plays solitaire" with the
     slips in the folder. (Page 25, first full paragraph of the page.)
   - "What to put in?" is as important as what to leave out.
5. Think about the alphabet
   - Think hard about the symbols you use, the notation used, because if
     it's adopted...then it's impossible to change.
   - Halmos says he writes tables of notation before writing a book,
     with different letters in different fonts and what they correspond to.
   - Personally, I'm not as pessimistic as Halmos. When he says
     something like "Who would dare write 'Let 6 be a group.'?", well
     finite group theorists do this! So perhaps we should not be quite
     as paranoid as Halmos when it comes to notation, but we should
     abstract away notational choices as LaTeX macros.
6. Write in spirals
   - It's impossible to know what to write until after it's done. You
     know what to put in chapter 1 (or how it should've been written)
     only once you've completed your draft and have moved on to
     chapter 2. But once you've finished chapter 2, you realize how much
     better it could have been if you had only written Chapter 1
     slightly differently.
   - Halmos says this is fine and natural, and that the correct order
     for writing a book is: 1, 2; 1, 2, 3; 1, 2, 3, 4; etc.
   - But the first step in writing, rewriting, re-rewriting, etc., is
     writing.
   - "There is no better incentive for writing a good book than a bad book."
   - In the first draft of each chapter, Halmos recommends that "you
     spill your heart, write quickly, violate all rules, write with hate
     or with pride, be snide, be confused, be 'funny' if you must, be
     unclear, be ungrammatical---just keep on writing."
   - Do not edit, but rewrite.
7. Organize always
   - Spiral writing goes hand-in-hand with spiral organizing
   - Review the material introduced in section 1 in future sections (as
     examples, limitations, generalizations, etc.). The material in
     sections 1 and 2 should be reviewed in section 3 (as examples,
     counter-examples, epitomizing various properties, etc.), and so on.
   - But in this process, you may realize there are important examples
     which should have been given in section 1 for use later on
   - This seems to be the gist of "spiral organizing"
8. Write good English
9. Honesty is the best policy
10. Down with the irrelevant and the trivial
11. Do and do not repeat
12. The editorial we is not all bad
13. Use words correctly
14. Use technical terms correctly
15. Resist symbols
16. Use symbols correctly
17. All communication is exposition
18. Defend your style
19. Stop
20. The last word

