docs/math/writing.html

<div id="outline-container-h-d767e507-f335-4eac-b937-89968dff4e2a" class="outline-3">
<h3 id="h-d767e507-f335-4eac-b937-89968dff4e2a"><span class="section-number-3">1.2.</span> Halmos's Essay</h3>
<div class="outline-text-3" id="text-h-d767e507-f335-4eac-b937-89968dff4e2a">
<p>
This is probably the most famous entry in the book, and can be found if
you google for it. The essay spans pages 19&#x2013;48 (so, roughly 29 of the
64 pages of the book, nearly half the book is Halmos's essay!). The
essay consists of 21 sections, beginning with section 0 "Preface".
</p>

<ol class="org-ol">
<li>Have something to say
<ul class="org-ul">
<li>The problem is to communicate an idea. To do so, and to do it
clearly, you must:
<ul class="org-ul">
<li>have something to say,</li>
<li>have someone to say it to,</li>
<li>organize what you want to say,</li>
<li>arrange it in the order you want it said in,</li>
<li>write it, rewrite it, re-rewrite it several times,</li>
<li>be willing to think hard about it and work hard on the mechanical
details (e.g., diction, notation, punctuation, etc.).</li>
</ul></li>
<li>That's basically it.</li>
</ul></li>
<li>Say something
<ul class="org-ul">
<li>Problem 1: you have nothing to say.</li>
<li>Problem 2: you have too much to say.
<ul class="org-ul">
<li>Calculus textbooks have this problem because "calculus" isn't a
single subject, it's an alloy: a mixture of
many interesting subjects.</li>
</ul></li>
<li>"To have something to say is by far the most important ingredient
of good exposition".</li>
</ul></li>
<li>Speak to someone
<ul class="org-ul">
<li>This determines:
<ul class="org-ul">
<li>the amount of motivation you need to put in,</li>
<li>the extent of informality you may allow yourself,</li>
<li>the fussiness of the detail that is necessary,</li>
<li>the number of times things have to be repeated.</li>
</ul></li>
<li>All writing is influenced by the audience. But given the audience,
an author's problem is then to communicate with it as best they can.</li>
<li>Anticipate and avoid the reader's difficulties.</li>
</ul></li>
<li>Organize first
<ul class="org-ul">
<li>Organize and arrange the material so as to (a) minimize the resistance
and maximize the insight of the reader, (b) keep the reader on
track with no unintended distractions.</li>
<li>Why prefer a book over a stack of papers?
<ul class="org-ul">
<li>Efficient and pleasant arrangement</li>
<li>Emphasis where emphasis is needed</li>
<li>Indication of interconnections</li>
<li>Description of examples and counter-examples on which the theory
is based.</li>
</ul></li>
<li>These are precisely "organization".</li>
<li>Once you know what you want to say (and to whom you want to say
it), the next step is to make an outline.</li>
<li>To organize a subject means: to decide what the main headings and
subheadings are, what goes under each, and what are the connections
among them. (A diagram of the organization is a graph, probably a
tree, but not a linear chain.) There are many ways to organize a
subject.
<ul class="org-ul">
<li>We then arrange the results of the method of organization in a
linear fashion.</li>
<li>Organization &gt; Arrangement.</li>
</ul></li>
<li>The preparation of an outline can take years (or, at the very
least, many weeks).</li>
<li>Halmos remarks that when he does his daily work, he daydreams about
the project, and as ideas occur he jots them down on loose slips of
paper then places them "helter-skelter" in a folder. Ideas could be
what fields of math to include, it could be a proof, it may be a
witticism. Then when Halmos writes, he "plays solitaire" with the
slips in the folder. (Page 25, first full paragraph of the page.)</li>
<li>"What to put in?" is as important as what to leave out.</li>
</ul></li>
<li>Think about the alphabet
<ul class="org-ul">
<li>Think hard about the symbols you use, the notation used, because if
it's adopted&#x2026;then it's impossible to change.</li>
<li>Halmos says he writes tables of notation before writing a book,
with different letters in different fonts and what they correspond to.</li>
<li>Personally, I'm not as pessimistic as Halmos. When he says
something like "Who would dare write 'Let 6 be a group.'?", well
finite group theorists do this! So perhaps we should not be quite
as paranoid as Halmos when it comes to notation, but we should
abstract away notational choices as LaTeX macros.</li>
</ul></li>
<li>Write in spirals
<ul class="org-ul">
<li>It's impossible to know what to write until after it's done. You
know what to put in chapter 1 (or how it should've been written)
only once you've completed your draft and have moved on to
chapter 2. But once you've finished chapter 2, you realize how much
better it could have been if you had only written Chapter 1
slightly differently.</li>
<li>Halmos says this is fine and natural, and that the correct order
for writing a book is: 1, 2; 1, 2, 3; 1, 2, 3, 4; etc.</li>
<li>But the first step in writing, rewriting, re-rewriting, etc., is
writing.</li>
<li>"There is no better incentive for writing a good book than a bad book."</li>
<li>In the first draft of each chapter, Halmos recommends that "you
spill your heart, write quickly, violate all rules, write with hate
or with pride, be snide, be confused, be 'funny' if you must, be
unclear, be ungrammatical&#x2014;just keep on writing."</li>
<li>Do not edit, but rewrite.</li>
</ul></li>
<li>Organize always
<ul class="org-ul">
<li>Spiral writing goes hand-in-hand with spiral organizing</li>
<li>Review the material introduced in section 1 in future sections (as
examples, limitations, generalizations, etc.). The material in
sections 1 and 2 should be reviewed in section 3 (as examples,
counter-examples, epitomizing various properties, etc.), and so on.</li>
<li>But in this process, you may realize there are important examples
which should have been given in section 1 for use later on</li>
<li>This seems to be the gist of "spiral organizing"</li>
</ul></li>
<li>Write good English</li>
<li>Honesty is the best policy</li>
<li>Down with the irrelevant and the trivial</li>
<li>Do and do not repeat</li>
<li>The editorial we is not all bad</li>
<li>Use words correctly</li>
<li>Use technical terms correctly</li>
<li>Resist symbols</li>
<li>Use symbols correctly</li>
<li>All communication is exposition</li>
<li>Defend your style</li>
<li>Stop</li>
<li>The last word</li>
</ol>
</div>
</div>
