math/writing.org
** Menahem M Schiffer's Essay
:PROPERTIES:
:CUSTOM_ID: h-80a67b77-d30c-4544-a2db-ce2d3d4c5692
:END:

1. Schiffer writes "more as a reader...than as an author". But there is
   no universal prescription for writing in a clear, informative,
   attractive manner.
2. When planning, the author must determine their audience and what
   amount (and type) of information the author wishes to
   transmit. Schiffer partitions the space of writing into four types of
   expositions: research paper, monograph, survey, textbooks.
3. *Research Paper.*
   - Generous quotation of sources, clear stating of facts used, precise
     definitions, complete proofs (if proofs are given at all).
   - It is very important to write a good introduction. You must help
     the reader determine if the paper is relevant to their research as
     quickly as possible.
4. *Monographs.*
   - Requires much more planning and attention than the research paper.
   - Since monographs have a longer lifetime than research papers, it's
     more important to plan and write well.
   - A monograph should include the background and motivation for basic
     concepts, the growth of ideas and methods, more detailed proofs
     should be provided, an extensive bibliography is a must.
   - A good introductory chapter should whet the appetite of the reader.
   - A historic and genetic approach may yield a good general guideline
     for organizing the monograph.
   - A monograph is not written to show how erudite and clever the
     author is, but to teach the reader some new material.
5. *Surveys.*
   - A survey is an invitation to a field of research, not an introduction.
   - Motivation, background, history, and problems should be displayed.
6. *Textbooks.* (This is the longest, or second longest, section of the piece)
   - Schiffer restricts discussion to writing advanced textbooks for
     senior or graduate level.
   - The purpose of a textbook is to take a student (with a specific
     amount of preparation) and introduce them to a new field of
     mathematical endeavor. Therefore the presupposed knowledge of the
     reader should be precisely realized, and the treatment of the
     textbook takes this carefully into consideration.
   - The textbook should rise from the known to the unknown in easy
     steps. It should start from the special and intuitive to the
     general and abstract.
   - Applications and examples should be generously given.
   - A real textbook should contain more material than could be covered
     in a single course. This allows teachers a certain amount of
     flexibility when using the textbook.
   - "The main desideratum would be that the solution to all significant
     problems in the exercise section should be given, or at least
     hinted at."
   - The textbook author should "aim for clear and interesting
     exposition rather than for completeness or novelty."
7. Now, instead of discussing "what book to write", Schiffer turns to
   the question "How to write it?"
   - Plans change and the production of any book is a process of
     successive approximation.
   - The worst moment in preparation of a book (or any writing) is the
     first moment staring at a blank sheet.
   - Schiffer's advice: start with a chapter which interests you the
     most, in which you think you can be most original and helpful.
   - Then ask yourself what material is needed to bridge from the
     presupposed knowledge of the reader to that chapter you've just
     written?
   - The auxiliary chapters are probably dry, unintersting, and consists
     of most of the text you've written. These chapters have to be
     fleshed out. "The important principle is that no chapter shall be
     entirely auxiliary and be the servant of some other chapter."
   - Schiffer contrasts this to how Polya writes his books. Polya uses a
     system which Polya calls "skeleton writing". Prepare the book
     according to your plan, but in a very sketch and incomplete
     way. Once the skeleton is ready, flesh it out and bring it to life.
   - Use the manuscript as the basis for a course to test (1) the clearness
     of exposition and (2) the logic of the arrangement.
   - Final advice: "Enjoy your writing and relax while doing so. Write
     in a natural style and leave the officialese and formal style to
     administrators and government departments."
     
** Dieudonne's Essay
:PROPERTIES:
:CUSTOM_ID: h-c2d89fe2-64b5-4ac8-a048-fecb8a294a8c
:END:

- This is a short essay (a mere 3 pages!) disagreeing with everything
  Steenrod advocates.

* Knuth, Larrabee, Roberts, "Mathematical Writing"
:PROPERTIES:
:CUSTOM_ID: h-3b77b4ed-12c1-4e96-b7dc-f4c6f448fc1b
:END:

This is a bunch of lecture notes, with all the shorthand and frustrating
cryptic ambiguity that lecture notes possess. The lectures have been
thrown up on [[https://youtube.com/playlist?list=PLABJEFgj0PWV22nvw3YKXvR_n1NB6fn5D&feature=shared][Youtube]] (and [[https://youtube.com/playlist?list=PLOdeqCXq1tXihn5KmyB2YTOqgxaUkcNYG&feature=shared][here]]). A draft [[https://jmlr.csail.mit.edu/reviewing-papers/knuth_mathematical_writing.pdf][PDF]] is online too.

** Lecture 10: Presenting Algorithms
:PROPERTIES:
:CUSTOM_ID: h-6a57ac3a-c0d6-4d90-be37-3c4961d24ccd
:END:

There's frustratingly little of use in this lecture.

*** About Algorithms
:PROPERTIES:
:CUSTOM_ID: h-0289f012-bf77-4cfa-8dea-76e6f2ccbaf4
:END:

My personal observations, reading Knuth's /Art of Computer Programming/,
is that the book is written about assembly programs. The "algorithm"
environments are really extended comments about the programs, rephrased
in complete generality so it resembles Theorems and could be applied in
any programming language. (I say this after having read a good chunk of
the book without even glancing at the MIXAL code; then revisiting the
books intent on learning MIXAL to transcribe some IBM-704 assembly.)

The numbered steps in the algorithms are useful when keeping track of
"where we are" in a MIXAL program.

The parenthetical remarks are invariants used in a formal proof of
correctness.

*** About ~WEB~
:PROPERTIES:
:CUSTOM_ID: h-cc41d351-971a-4d9b-82f6-69e4cb294a2f
:END:

Knuth introduces the ~WEB~ system in this lecture. It's based on two
principles of writing:

1. The correct way to explain a complex thing is to break it into parts
   and then explaineach part;
2. Things should be explained twice (formally and informally).

These two principles naturally led to programs made of modules that
begin with text (informal explanation) and finish with Pascal (formal
explanation).

** Lecture 11: Literate Programming
:PROPERTIES:
:CUSTOM_ID: h-cb32061d-d5c9-49fd-911f-43369b0d4638
:END:

A lot of rules about Pascal programming in ~WEB~. Perhaps the only gem
in this lecture is: "We are trying to convey an intuition of what is going on, so a high-level account
is much more helpful."

Each module/section/chunk of code should be manageable in size. Knuth
thinks about a dozen lines of code is just about the right size.