docs/math/writing.html

<div id="outline-container-h-80a67b77-d30c-4544-a2db-ce2d3d4c5692" class="outline-3">
<h3 id="h-80a67b77-d30c-4544-a2db-ce2d3d4c5692"><span class="section-number-3">1.3.</span> Menahem M Schiffer's Essay</h3>
<div class="outline-text-3" id="text-h-80a67b77-d30c-4544-a2db-ce2d3d4c5692">
<ol class="org-ol">
<li>Schiffer writes "more as a reader&#x2026;than as an author". But there is
no universal prescription for writing in a clear, informative,
attractive manner.</li>
<li>When planning, the author must determine their audience and what
amount (and type) of information the author wishes to
transmit. Schiffer partitions the space of writing into four types of
expositions: research paper, monograph, survey, textbooks.</li>
<li><b>Research Paper.</b>
<ul class="org-ul">
<li>Generous quotation of sources, clear stating of facts used, precise
definitions, complete proofs (if proofs are given at all).</li>
<li>It is very important to write a good introduction. You must help
the reader determine if the paper is relevant to their research as
quickly as possible.</li>
</ul></li>
<li><b>Monographs.</b>
<ul class="org-ul">
<li>Requires much more planning and attention than the research paper.</li>
<li>Since monographs have a longer lifetime than research papers, it's
more important to plan and write well.</li>
<li>A monograph should include the background and motivation for basic
concepts, the growth of ideas and methods, more detailed proofs
should be provided, an extensive bibliography is a must.</li>
<li>A good introductory chapter should whet the appetite of the reader.</li>
<li>A historic and genetic approach may yield a good general guideline
for organizing the monograph.</li>
<li>A monograph is not written to show how erudite and clever the
author is, but to teach the reader some new material.</li>
</ul></li>
<li><b>Surveys.</b>
<ul class="org-ul">
<li>A survey is an invitation to a field of research, not an introduction.</li>
<li>Motivation, background, history, and problems should be displayed.</li>
</ul></li>
<li><b>Textbooks.</b> (This is the longest, or second longest, section of the piece)
<ul class="org-ul">
<li>Schiffer restricts discussion to writing advanced textbooks for
senior or graduate level.</li>
<li>The purpose of a textbook is to take a student (with a specific
amount of preparation) and introduce them to a new field of
mathematical endeavor. Therefore the presupposed knowledge of the
reader should be precisely realized, and the treatment of the
textbook takes this carefully into consideration.</li>
<li>The textbook should rise from the known to the unknown in easy
steps. It should start from the special and intuitive to the
general and abstract.</li>
<li>Applications and examples should be generously given.</li>
<li>A real textbook should contain more material than could be covered
in a single course. This allows teachers a certain amount of
flexibility when using the textbook.</li>
<li>"The main desideratum would be that the solution to all significant
problems in the exercise section should be given, or at least
hinted at."</li>
<li>The textbook author should "aim for clear and interesting
exposition rather than for completeness or novelty."</li>
</ul></li>
<li>Now, instead of discussing "what book to write", Schiffer turns to
the question "How to write it?"
<ul class="org-ul">
<li>Plans change and the production of any book is a process of
successive approximation.</li>
<li>The worst moment in preparation of a book (or any writing) is the
first moment staring at a blank sheet.</li>
<li>Schiffer's advice: start with a chapter which interests you the
most, in which you think you can be most original and helpful.</li>
<li>Then ask yourself what material is needed to bridge from the
presupposed knowledge of the reader to that chapter you've just
written?</li>
<li>The auxiliary chapters are probably dry, unintersting, and consists
of most of the text you've written. These chapters have to be
fleshed out. "The important principle is that no chapter shall be
entirely auxiliary and be the servant of some other chapter."</li>
<li>Schiffer contrasts this to how Polya writes his books. Polya uses a
system which Polya calls "skeleton writing". Prepare the book
according to your plan, but in a very sketch and incomplete
way. Once the skeleton is ready, flesh it out and bring it to life.</li>
<li>Use the manuscript as the basis for a course to test (1) the clearness
of exposition and (2) the logic of the arrangement.</li>
<li>Final advice: "Enjoy your writing and relax while doing so. Write
in a natural style and leave the officialese and formal style to
administrators and government departments."</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-h-c2d89fe2-64b5-4ac8-a048-fecb8a294a8c" class="outline-3">
<h3 id="h-c2d89fe2-64b5-4ac8-a048-fecb8a294a8c"><span class="section-number-3">1.4.</span> Dieudonne's Essay</h3>
<div class="outline-text-3" id="text-h-c2d89fe2-64b5-4ac8-a048-fecb8a294a8c">
<ul class="org-ul">
<li>This is a short essay (a mere 3 pages!) disagreeing with everything
Steenrod advocates.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-h-3b77b4ed-12c1-4e96-b7dc-f4c6f448fc1b" class="outline-2">
<h2 id="h-3b77b4ed-12c1-4e96-b7dc-f4c6f448fc1b"><span class="section-number-2">2.</span> Knuth, Larrabee, Roberts, "Mathematical Writing"</h2>
<div class="outline-text-2" id="text-h-3b77b4ed-12c1-4e96-b7dc-f4c6f448fc1b">
<p>
This is a bunch of lecture notes, with all the shorthand and frustrating
cryptic ambiguity that lecture notes possess. The lectures have been
thrown up on <a href="https://youtube.com/playlist?list=PLABJEFgj0PWV22nvw3YKXvR_n1NB6fn5D&amp;feature=shared">Youtube</a> (and <a href="https://youtube.com/playlist?list=PLOdeqCXq1tXihn5KmyB2YTOqgxaUkcNYG&amp;feature=shared">here</a>). A draft <a href="https://jmlr.csail.mit.edu/reviewing-papers/knuth_mathematical_writing.pdf">PDF</a> is online too.
</p>
</div>

<div id="outline-container-h-6a57ac3a-c0d6-4d90-be37-3c4961d24ccd" class="outline-3">
<h3 id="h-6a57ac3a-c0d6-4d90-be37-3c4961d24ccd"><span class="section-number-3">2.1.</span> Lecture 10: Presenting Algorithms</h3>
<div class="outline-text-3" id="text-h-6a57ac3a-c0d6-4d90-be37-3c4961d24ccd">
<p>
There's frustratingly little of use in this lecture.
</p>
</div>

<div id="outline-container-h-0289f012-bf77-4cfa-8dea-76e6f2ccbaf4" class="outline-4">
<h4 id="h-0289f012-bf77-4cfa-8dea-76e6f2ccbaf4"><span class="section-number-4">2.1.1.</span> About Algorithms</h4>
<div class="outline-text-4" id="text-h-0289f012-bf77-4cfa-8dea-76e6f2ccbaf4">
<p>
My personal observations, reading Knuth's <i>Art of Computer Programming</i>,
is that the book is written about assembly programs. The "algorithm"
environments are really extended comments about the programs, rephrased
in complete generality so it resembles Theorems and could be applied in
any programming language. (I say this after having read a good chunk of
the book without even glancing at the MIXAL code; then revisiting the
books intent on learning MIXAL to transcribe some IBM-704 assembly.)
</p>

<p>
The numbered steps in the algorithms are useful when keeping track of
"where we are" in a MIXAL program.
</p>

<p>
The parenthetical remarks are invariants used in a formal proof of
correctness.
</p>
</div>
</div>

<div id="outline-container-h-cc41d351-971a-4d9b-82f6-69e4cb294a2f" class="outline-4">
<h4 id="h-cc41d351-971a-4d9b-82f6-69e4cb294a2f"><span class="section-number-4">2.1.2.</span> About <code>WEB</code></h4>
<div class="outline-text-4" id="text-h-cc41d351-971a-4d9b-82f6-69e4cb294a2f">
<p>
Knuth introduces the <code>WEB</code> system in this lecture. It's based on two
principles of writing:
</p>

<ol class="org-ol">
<li>The correct way to explain a complex thing is to break it into parts
and then explaineach part;</li>
<li>Things should be explained twice (formally and informally).</li>
</ol>

<p>
These two principles naturally led to programs made of modules that
begin with text (informal explanation) and finish with Pascal (formal
explanation).
</p>
</div>
</div>
</div>

<div id="outline-container-h-cb32061d-d5c9-49fd-911f-43369b0d4638" class="outline-3">
<h3 id="h-cb32061d-d5c9-49fd-911f-43369b0d4638"><span class="section-number-3">2.2.</span> Lecture 11: Literate Programming</h3>
<div class="outline-text-3" id="text-h-cb32061d-d5c9-49fd-911f-43369b0d4638">
<p>
A lot of rules about Pascal programming in <code>WEB</code>. Perhaps the only gem
in this lecture is: "We are trying to convey an intuition of what is going on, so a high-level account
is much more helpful."
</p>

<p>
Each module/section/chunk of code should be manageable in size. Knuth
thinks about a dozen lines of code is just about the right size.</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="postamble">Last Updated 2024-06-05 Wed 08:53.</p>
</div>
</body>
</html>
